{
  "backend/main.mo": "Main Motoko actor defining Product type with CRUD operations, user profile management, and access control using authorization and blob storage mixins; admin-only product management and public product queries.",
  "feature_evidence.json": "Feature evidence report documenting five implemented features: product catalog interface, WhatsApp contact buttons, public browsing, admin panel with Internet Identity, and warm earthy design aesthetic with high confidence levels.",
  "frontend-file-summaries.txt": "JSON object containing summaries of all frontend files including components, pages, hooks, and configuration for the product showcase application with admin panel and public catalog.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining warm earthy color palette using OKLCH color system for both light and dark modes with design tokens for borders, backgrounds, and UI elements.",
  "frontend/index.html": "HTML entry point with viewport meta tag, 'Product Showcase' title, root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Main React app component using TanStack Router to define routes for public catalog (root), admin panel, create product, and edit product pages with Layout wrapper including Header and Footer.",
  "frontend/src/components/AdminGuard.tsx": "Authorization wrapper component that checks authentication and admin status, displaying loading spinner, login required message, or access denied message before rendering protected admin content.",
  "frontend/src/components/Footer.tsx": "Footer component displaying copyright notice and 'Built with caffeine.ai' attribution link with UTM tracking parameters based on hostname.",
  "frontend/src/components/Header.tsx": "Sticky header with site branding, conditional admin panel link (visible only to authenticated admins), and login button with backdrop blur effect.",
  "frontend/src/components/LoginButton.tsx": "Internet Identity login/logout button with loading states, icons, and query cache clearing on logout with error handling for authentication edge cases.",
  "frontend/src/components/ProductCard.tsx": "Displays a single product with image, name, description, price, and a WhatsApp contact button. Includes hover effects and fallback UI for missing images.",
  "frontend/src/components/ProductGrid.tsx": "Renders a responsive grid of ProductCard components or shows an empty state message when no products are available.",
  "frontend/src/components/WhatsAppButton.tsx": "Button component that opens WhatsApp with a pre-filled message about a specific product when clicked.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor with authentication, initializing access control with admin token and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useCreateProduct.ts": "Mutation hook for creating new products via the backend actor, invalidating the products query on success.",
  "frontend/src/hooks/useDeleteProduct.ts": "Mutation hook for deleting products by ID via the backend actor, invalidating the products query on success.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login/logout functionality, identity management, and status tracking for the entire application.",
  "frontend/src/hooks/useIsAdmin.ts": "Query hook that checks if the current authenticated user has admin privileges by calling the backend actor.",
  "frontend/src/hooks/useProduct.ts": "Query hook that fetches a single product by ID from the backend actor.",
  "frontend/src/hooks/useProducts.ts": "Query hook that fetches all products from the backend actor.",
  "frontend/src/hooks/useUpdateProduct.ts": "Mutation hook for updating existing products via the backend actor, invalidating both products list and individual product queries on success.",
  "frontend/src/index.css": "Global styles with Tailwind CSS, custom CSS variables for light/dark theme color palette, and typography configuration using Playfair Display and Inter fonts.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component.",
  "frontend/src/pages/AdminPanel.tsx": "Admin dashboard page displaying a table of all products with edit/delete actions and a button to create new products.",
  "frontend/src/pages/CreateProduct.tsx": "React component for creating new products with form inputs for name, description, price, WhatsApp number, and image upload with preview and progress tracking.",
  "frontend/src/pages/EditProduct.tsx": "React component for editing existing products, fetching product data by ID and allowing updates to all product fields including optional image replacement.",
  "frontend/src/pages/PublicCatalog.tsx": "Public-facing product catalog page with hero banner and product grid, displaying all products with loading and error states.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters and session storage, supporting both standard and hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH, typography settings, animations, and design tokens for a modern boutique aesthetic.",
  "project_state.json": "Project metadata defining a commercial product catalog with WhatsApp integration, admin panel, and public browsing without authentication requirements."
}