{
  "backend/main.mo": "Main actor implementing an e-commerce backend with product management (CRUD with categories and stock), shopping cart functionality, COD checkout with shipping details, order tracking with status updates, user profiles, and role-based access control using authorization and blob storage mixins.",
  "backend/migration.mo": "Migration module that transforms old product and user profile data structures to new versions by adding category/stock fields to products (defaulting to electronics/100) and phone/address/city fields to user profiles (defaulting to 'Not provided').",
  "feature_evidence.json": "Feature evidence report documenting four implemented features: shopping cart system, COD checkout flow, Internet Identity user authentication, and order tracking system, with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of frontend files describing components for product display, admin management, cart functionality, checkout flow, order tracking, authentication, and styling with modern blue e-commerce theme.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark theme color palettes using OKLCH color space for consistent design system across the application.",
  "frontend/index.html": "HTML entry point with viewport meta tag, 'Product Showcase' title, root div for React mounting, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for public catalog, checkout, order management, and admin panel (with guards), wrapped in ThemeProvider and LanguageProvider with page transitions.",
  "frontend/src/components/AddToCartButton.tsx": "Button component for adding products to cart with quantity support, authentication checks, out-of-stock handling, loading states, and internationalization.",
  "frontend/src/components/AdminGuard.tsx": "A guard component that checks authentication and admin privileges, displaying loading states, login prompts, or access denied messages before rendering protected admin content.",
  "frontend/src/components/CartDrawer.tsx": "A slide-out drawer component that displays cart items with quantity controls, removal options, and a checkout button, including empty state and loading states.",
  "frontend/src/components/CategoryBadge.tsx": "Displays a colored badge for product categories with localized labels (electronics, clothing, home, books, sports).",
  "frontend/src/components/CategoryFilter.tsx": "Renders a set of filter buttons for product categories, allowing users to filter by category or view all products.",
  "frontend/src/components/Footer.tsx": "A footer component displaying copyright information and a \"Built with caffeine.ai\" attribution link.",
  "frontend/src/components/Header.tsx": "Main navigation header with logo, desktop/mobile navigation, cart button with item count, language toggle, and login button, with conditional rendering for authenticated and admin users.",
  "frontend/src/components/LanguageToggle.tsx": "A button component that toggles between English and Nepali languages using the language context.",
  "frontend/src/components/LoadingSkeleton.tsx": "Provides skeleton loading components for product cards and product grids to display during data fetching.",
  "frontend/src/components/LoginButton.tsx": "Handles Internet Identity authentication with login/logout functionality, displaying appropriate icons and loading states.",
  "frontend/src/components/MobileNav.tsx": "A mobile hamburger menu that slides down to show navigation links (products, orders, admin panel) with language toggle and login button.",
  "frontend/src/components/OrderStatusBadge.tsx": "Displays a colored badge representing order status (pending, processing, shipped, delivered) with localized labels.",
  "frontend/src/components/PageTransition.tsx": "A simple wrapper component that applies a fade-in animation to page content.",
  "frontend/src/components/ProductCard.tsx": "Displays a single product with image, name, description, price, category badge, stock status indicators, and either an add-to-cart button (authenticated users) or WhatsApp contact button (guests).",
  "frontend/src/components/ProductGrid.tsx": "Renders a responsive grid layout of ProductCard components, displaying a message when no products are available.",
  "frontend/src/components/ProductSearch.tsx": "Provides a search input with debounced query handling (300ms delay) and a clear button, triggering the onSearch callback with the current query.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts authenticated users without a profile to enter their name, phone, address, and city; blocks dismissal until profile is saved.",
  "frontend/src/components/WhatsAppButton.tsx": "Button component that opens WhatsApp with a pre-filled message expressing interest in a specific product.",
  "frontend/src/contexts/LanguageContext.tsx": "Provides language context (English/Nepali) with localStorage persistence and translation function for UI strings throughout the application.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance with authentication, initializes access control with admin token, and invalidates dependent queries when identity changes.",
  "frontend/src/hooks/useAddToCart.ts": "Mutation hook for adding items to cart, invalidates cart queries on success and shows toast notifications.",
  "frontend/src/hooks/useAllOrders.ts": "Query hook that fetches all orders from the backend using the actor instance.",
  "frontend/src/hooks/useCart.ts": "Query hook that fetches the current user's cart items, enabled only when authenticated.",
  "frontend/src/hooks/useCheckout.ts": "Mutation hook for processing checkout with shipping details, invalidates cart, orders, and products queries on success.",
  "frontend/src/hooks/useCreateProduct.ts": "Mutation hook for creating new products with name, description, price, image, WhatsApp number, category, and stock; invalidates products query on success.",
  "frontend/src/hooks/useDeleteProduct.ts": "Mutation hook for deleting products by ID, invalidates products query on success.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "Query hook that fetches the authenticated user's profile, enabled only when actor is ready and user is authenticated.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity storage, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useIsAdmin.ts": "Custom hook that queries the backend to check if the current authenticated user has admin privileges.",
  "frontend/src/hooks/useLowStockProducts.ts": "Custom hook that fetches products with stock levels below a specified threshold using React Query.",
  "frontend/src/hooks/useOrder.ts": "Custom hook that fetches a single order by ID from the backend actor.",
  "frontend/src/hooks/useOrdersByStatus.ts": "Custom hook that fetches all orders filtered by a specific OrderStatus.",
  "frontend/src/hooks/useProduct.ts": "Custom hook that fetches a single product by ID from the backend actor.",
  "frontend/src/hooks/useProducts.ts": "Custom hook that fetches all products from the backend actor.",
  "frontend/src/hooks/useRemoveFromCart.ts": "Custom mutation hook that removes a product from the cart and invalidates cart queries on success.",
  "frontend/src/hooks/useSaveCallerUserProfile.ts": "Custom mutation hook that saves the current user's profile and invalidates the user profile query on success.",
  "frontend/src/hooks/useUpdateCartQuantity.ts": "Custom mutation hook that updates the quantity of a product in the cart and invalidates cart queries on success.",
  "frontend/src/hooks/useUpdateOrderStatus.ts": "Custom mutation hook that updates an order's status and invalidates related order queries on success.",
  "frontend/src/hooks/useUpdateProduct.ts": "Custom mutation hook that updates product details including name, description, price, image, category, and stock, then invalidates product queries.",
  "frontend/src/hooks/useUserOrders.ts": "Custom hook that fetches all orders for the currently authenticated user.",
  "frontend/src/index.css": "Global CSS file defining Tailwind configuration, CSS custom properties for light/dark themes with an e-commerce color palette, typography styles, and custom animations.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/AdminOrderDetails.tsx": "Admin page displaying detailed order information with the ability to update order status through a dropdown selector.",
  "frontend/src/pages/AdminOrders.tsx": "Admin page showing a filterable list of all orders with status badges, allowing navigation to individual order details.",
  "frontend/src/pages/AdminPanel.tsx": "Admin dashboard page for managing products with a table view showing product details, stock alerts, and actions to create, edit, or delete products. Includes navigation to order management and displays low-stock warnings.",
  "frontend/src/pages/Checkout.tsx": "Checkout page with a form for shipping details (name, phone, address, city) and an order summary displaying cart items and total. Submits order and redirects to order confirmation on success.",
  "frontend/src/pages/CreateProduct.tsx": "Product creation form for admins with fields for name, description, price, WhatsApp number, category, stock, and image upload. Handles image preview and upload progress before submitting to backend.",
  "frontend/src/pages/EditProduct.tsx": "Product editing form that loads existing product data and allows admins to update all product fields including optional image replacement. Preserves existing image if no new file is uploaded.",
  "frontend/src/pages/MyOrders.tsx": "User order history page displaying a list of orders with order ID, status badge, item count, and total price. Each order is clickable to view details.",
  "frontend/src/pages/OrderConfirmation.tsx": "Order confirmation success page showing order ID, estimated delivery time, and action buttons to view order details or continue shopping.",
  "frontend/src/pages/OrderDetails.tsx": "Displays detailed information for a specific order including order ID, total, status badge, shipping details (name, phone, address), and ordered items with images and prices. Uses React Router for navigation and includes loading/error states.",
  "frontend/src/pages/PublicCatalog.tsx": "Main product catalog page with hero banner, search functionality, category filtering, and product grid display. Implements responsive design with different hero images for mobile/desktop and handles loading/error/empty states.",
  "frontend/src/translations/translations.ts": "Empty translation file kept for reference; actual translations are now managed in LanguageContext for better performance.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support for parameters like admin tokens.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended typography, container queries, animations (accordion, fade-in), custom shadows (soft, elegant), and responsive breakpoints.",
  "project_state.json": "Project metadata defining a mobile-first e-commerce app for Nepal with cash-on-delivery, dual user roles (customer/admin), shopping cart, order tracking, multi-language support, and lists existing features with requirement IDs."
}