{
  "backend/main.mo": "Main backend actor defining product catalog, cart, order, and user profile management with role-based access control (admin/user permissions) and blob storage integration.",
  "feature_evidence.json": "Feature evidence report documenting four implemented features: admin dashboard with metrics, custom React hooks for statistics, navigation links to dashboard, and recent orders display.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, pages, hooks, and configuration for the e-commerce application with admin dashboard functionality.",
  "frontend/index.css": "Global CSS with Tailwind directives defining design tokens for light and dark themes using OKLCH color space with sidebar, chart, and UI component variables.",
  "frontend/index.html": "HTML entry point with root div and module script reference to main.tsx for the Product Showcase application.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for public catalog, checkout, orders, and admin pages (dashboard, panel, product management, orders) wrapped in theme and language providers.",
  "frontend/src/components/AddToCartButton.tsx": "Button component for adding products to cart with authentication check, out-of-stock handling, loading states, and internationalization support.",
  "frontend/src/components/AdminGuard.tsx": "Authorization wrapper component that verifies user authentication and admin privileges, displaying appropriate loading, login required, or access denied messages.",
  "frontend/src/components/CartDrawer.tsx": "A sliding drawer component that displays cart items with quantity controls, remove buttons, and a checkout button. Includes empty cart state with shopping bag icon and loading states.",
  "frontend/src/components/CategoryBadge.tsx": "Displays a colored badge for product categories (electronics, clothing, home, books, sports) with localized labels and category-specific background colors.",
  "frontend/src/components/CategoryFilter.tsx": "Renders a horizontal list of category filter buttons including an 'All Categories' option, with active state styling and localized labels.",
  "frontend/src/components/Footer.tsx": "A simple footer component displaying copyright information and a 'Built with caffeine.ai' attribution link with a heart icon.",
  "frontend/src/components/Header.tsx": "Main navigation header with logo, desktop/mobile navigation, cart button with item count badge, language toggle, and conditional admin/user links based on authentication and role.",
  "frontend/src/components/LanguageToggle.tsx": "A button component that toggles between English and Nepali languages, displaying a language icon and the current language label.",
  "frontend/src/components/LoadingSkeleton.tsx": "Provides skeleton loading components for product cards and product grids using shadcn/ui Skeleton components for better loading UX.",
  "frontend/src/components/LoginButton.tsx": "Handles Internet Identity authentication with login/logout functionality, loading states, error handling, and query cache clearing on logout.",
  "frontend/src/components/MobileNav.tsx": "Mobile navigation menu with hamburger toggle, overlay backdrop, and links to products, orders, admin dashboard, plus language toggle and login button.",
  "frontend/src/components/OrderStatusBadge.tsx": "Displays a colored badge for order status (pending, processing, shipped, delivered) with localized labels and status-specific colors.",
  "frontend/src/components/PageTransition.tsx": "A simple wrapper component that applies a fade-in animation to its children for page transitions.",
  "frontend/src/components/ProductCard.tsx": "Displays a product with image, name, description, price, category badge, stock status indicators, and either an add-to-cart button (authenticated) or WhatsApp button (guest).",
  "frontend/src/components/ProductGrid.tsx": "Renders a responsive grid of ProductCard components with an empty state message when no products are available.",
  "frontend/src/components/ProductSearch.tsx": "A search input component with debounced query handling (300ms delay) that displays a search icon and clear button, calling the onSearch callback when the query changes.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that appears for authenticated users without a profile, collecting name, phone, address, and city information through a form that saves to the backend using useSaveCallerUserProfile hook.",
  "frontend/src/components/WhatsAppButton.tsx": "A button component that opens WhatsApp with a pre-filled message about a product, formatting the phone number and product name into a WhatsApp deep link.",
  "frontend/src/contexts/LanguageContext.tsx": "Provides language context for English and Nepali translations with toggle functionality and a translation function (t) that maps keys to localized strings for UI elements.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance based on Internet Identity authentication state, initializing access control with an admin token and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAddToCart.ts": "A mutation hook that adds items to the cart via the actor, invalidates cart queries on success, and displays toast notifications for success or error states.",
  "frontend/src/hooks/useAllOrders.ts": "A query hook that fetches all orders from the backend actor, enabled only when the actor is available and not fetching.",
  "frontend/src/hooks/useCart.ts": "A query hook that fetches the current user's cart items, enabled only when authenticated with a valid actor and identity.",
  "frontend/src/hooks/useCheckout.ts": "A mutation hook that processes checkout with shipping details, invalidating cart, orders, and products queries on successful completion.",
  "frontend/src/hooks/useCreateProduct.ts": "A mutation hook that creates a new product with name, description, price, image, WhatsApp number, category, and stock, invalidating the products query on success.",
  "frontend/src/hooks/useDeleteProduct.ts": "A mutation hook that deletes a product by ID and invalidates the products query cache on successful deletion.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "A query hook that fetches the authenticated user's profile, enabled only when actor and identity are available, with combined loading state from actor fetching and query loading.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks, managing login/logout flow, identity state, delegation validation, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useIsAdmin.ts": "A query hook that checks if the current authenticated user has admin privileges, returning false by default and enabled only when actor and identity are ready.",
  "frontend/src/hooks/useLowStockCount.ts": "A query hook that fetches the count of products below a stock threshold (default 10), with refetch on mount enabled.",
  "frontend/src/hooks/useLowStockProducts.ts": "A query hook that fetches products below a specified stock threshold, returning an empty array when actor is unavailable.",
  "frontend/src/hooks/useOrder.ts": "A query hook that fetches a single order by ID, enabled only when actor is available and orderId is provided.",
  "frontend/src/hooks/useOrdersByStatus.ts": "A query hook that fetches orders filtered by OrderStatus, returning an empty array when actor is unavailable.",
  "frontend/src/hooks/usePendingOrders.ts": "A query hook that fetches the count of pending orders as a bigint, with refetch on mount enabled.",
  "frontend/src/hooks/useProduct.ts": "A query hook that fetches a single product by ID, enabled only when actor is available and ID is provided.",
  "frontend/src/hooks/useProducts.ts": "A query hook that fetches all products from the backend, returning an empty array when actor is unavailable.",
  "frontend/src/hooks/useRemoveFromCart.ts": "React hook that provides a mutation to remove a product from the cart by ID and invalidates the cart query on success.",
  "frontend/src/hooks/useSaveCallerUserProfile.ts": "React hook that provides a mutation to save the current user's profile and invalidates the currentUserProfile query on success.",
  "frontend/src/hooks/useTotalOrders.ts": "React hook that queries and returns the total number of orders as a bigint from the backend actor.",
  "frontend/src/hooks/useTotalProducts.ts": "React hook that queries and returns the total number of products as a bigint from the backend actor.",
  "frontend/src/hooks/useTotalRevenue.ts": "React hook that queries and returns the total revenue as a bigint from the backend actor.",
  "frontend/src/hooks/useUpdateCartQuantity.ts": "React hook that provides a mutation to update the quantity of a product in the cart and invalidates the cart query on success.",
  "frontend/src/hooks/useUpdateOrderStatus.ts": "React hook that provides a mutation to update an order's status and invalidates both orders and order queries on success.",
  "frontend/src/hooks/useUpdateProduct.ts": "React hook that provides a mutation to update a product with all its fields (name, description, price, image, whatsapp, category, stock) and invalidates the products query on success.",
  "frontend/src/hooks/useUserOrders.ts": "React hook that queries and returns the authenticated user's orders, enabled only when actor and identity are available.",
  "frontend/src/index.css": "Global CSS file with Tailwind imports, custom CSS variables for light/dark theme colors, typography styles, and custom animations (slide-in-right, slide-down, scale-in).",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page displaying key metrics (total products, orders, pending orders, low stock, revenue) and a list of the 5 most recent orders with navigation to detailed views.",
  "frontend/src/pages/AdminOrderDetails.tsx": "Admin page for viewing and updating a single order's details including status, customer information, shipping address, and ordered items.",
  "frontend/src/pages/AdminOrders.tsx": "Admin page displaying all orders with filtering by status (all, pending, processing, shipped, delivered) and navigation to individual order details.",
  "frontend/src/pages/AdminPanel.tsx": "Admin dashboard page for managing products with a table view showing all products, low stock alerts, and actions to create, edit, or delete products. Includes navigation to orders and dashboard pages.",
  "frontend/src/pages/Checkout.tsx": "Checkout page with a form for shipping details (name, phone, address, city) and an order summary showing cart items and total. Submits order and navigates to confirmation page.",
  "frontend/src/pages/CreateProduct.tsx": "Form page for creating new products with fields for name, description, price, WhatsApp number, category, stock, and image upload with preview. Handles image file conversion to ExternalBlob with upload progress tracking.",
  "frontend/src/pages/EditProduct.tsx": "Form page for editing existing products, pre-populating fields from fetched product data. Allows updating all product fields including optional image replacement with upload progress tracking.",
  "frontend/src/pages/MyOrders.tsx": "User orders list page displaying all orders with status badges, item counts, and totals. Each order is clickable to view details, with empty state prompting to start shopping.",
  "frontend/src/pages/OrderConfirmation.tsx": "Order confirmation success page showing order ID, estimated delivery time, and delivery notes. Provides buttons to view order details or continue shopping.",
  "frontend/src/pages/OrderDetails.tsx": "Displays detailed order information including order ID, total, status badge, shipping details (name, phone, address), and ordered items with images and prices. Includes a back button to return to the orders list.",
  "frontend/src/pages/PublicCatalog.tsx": "Public-facing product catalog page with hero banner, search functionality, category filtering, and product grid display. Shows loading skeletons and empty states when appropriate.",
  "frontend/src/translations/translations.ts": "Empty translation file kept for reference; actual translations are now managed in the LanguageContext for better performance.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support for parameters like admin tokens.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, custom shadows, animations, typography, and container queries plugins.",
  "project_state.json": "Project metadata defining a mobile-first e-commerce app for NPJ Shopping with cash-on-delivery, admin dashboard, customer authentication, shopping cart, order tracking, multi-language support, and existing feature list."
}