{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Create comprehensive admin dashboard with analytics and metrics",
  "requirements": [
    {
      "id": "REQ-19",
      "summary": "Create an admin dashboard page displaying key business metrics including total products count, total orders count, pending orders count, low stock products count, and total revenue from all completed orders",
      "acceptanceCriteria": [
        "Dashboard displays a grid of metric cards showing total products, total orders, pending orders, low stock items, and revenue",
        "Each metric card shows the numeric value with a descriptive label",
        "Metrics are automatically calculated from existing data",
        "Dashboard is accessible from the admin panel navigation",
        "Dashboard uses the existing modern blue e-commerce design theme"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminDashboard.tsx",
          "operation": "create",
          "description": "Create the main admin dashboard page component that displays a grid of metric cards (total products, total orders, pending orders, low stock count, total revenue). Each card shows a numeric value with a descriptive label and an icon from lucide-react. The component uses the custom hooks (useTotalProducts, useTotalOrders, usePendingOrders, useLowStockCount, useTotalRevenue) to fetch data. Include loading states while metrics are being fetched and error handling for failed queries. Apply the existing modern blue e-commerce design theme with consistent card styling, shadows, and spacing. Wrap the page content in AdminGuard to ensure only authenticated admin users can access it."
        }
      ]
    },
    {
      "id": "REQ-21",
      "summary": "Create custom React hooks for each dashboard statistic: useTotalProducts, useTotalOrders, usePendingOrders, useLowStockCount, and useTotalRevenue that fetch data from the backend",
      "acceptanceCriteria": [
        "Each hook uses React Query for data fetching with appropriate cache keys",
        "Hooks handle loading and error states",
        "Hooks are only enabled when user is authenticated as admin",
        "Data refreshes when navigating to the dashboard"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useTotalProducts.ts",
          "operation": "create",
          "description": "Create a custom hook that uses React Query to fetch the total products count from the backend getTotalProducts method. Use the cache key ['totalProducts']. Enable the query only when the actor is available and the user is authenticated. Handle loading and error states appropriately. Set refetchOnMount to true to ensure data refreshes when navigating to the dashboard."
        },
        {
          "path": "frontend/src/hooks/useTotalOrders.ts",
          "operation": "create",
          "description": "Create a custom hook that uses React Query to fetch the total orders count from the backend getTotalOrders method. Use the cache key ['totalOrders']. Enable the query only when the actor is available and the user is authenticated. Handle loading and error states appropriately. Set refetchOnMount to true to ensure data refreshes when navigating to the dashboard."
        },
        {
          "path": "frontend/src/hooks/usePendingOrders.ts",
          "operation": "create",
          "description": "Create a custom hook that uses React Query to fetch the pending orders count from the backend getPendingOrdersCount method. Use the cache key ['pendingOrdersCount']. Enable the query only when the actor is available and the user is authenticated. Handle loading and error states appropriately. Set refetchOnMount to true to ensure data refreshes when navigating to the dashboard."
        },
        {
          "path": "frontend/src/hooks/useLowStockCount.ts",
          "operation": "create",
          "description": "Create a custom hook that uses React Query to fetch the low stock products count from the backend getLowStockCount method, passing a threshold parameter (e.g., 10n as bigint). Use the cache key ['lowStockCount', threshold]. Enable the query only when the actor is available and the user is authenticated. Handle loading and error states appropriately. Set refetchOnMount to true to ensure data refreshes when navigating to the dashboard."
        },
        {
          "path": "frontend/src/hooks/useTotalRevenue.ts",
          "operation": "create",
          "description": "Create a custom hook that uses React Query to fetch the total revenue from the backend getTotalRevenue method. Use the cache key ['totalRevenue']. Enable the query only when the actor is available and the user is authenticated. Handle loading and error states appropriately. Set refetchOnMount to true to ensure data refreshes when navigating to the dashboard."
        }
      ]
    },
    {
      "id": "REQ-22",
      "summary": "Add a navigation link to the admin dashboard from the AdminPanel page header and from the main Header component when user is logged in as admin",
      "acceptanceCriteria": [
        "Dashboard link appears in admin navigation alongside existing admin options",
        "Link is only visible to authenticated admin users",
        "Clicking the link navigates to the dashboard route",
        "Dashboard link uses appropriate icon from lucide-react"
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add a new route for the admin dashboard at path '/admin/dashboard'. Import AdminDashboard component and register the route in the router configuration alongside existing admin routes (AdminPanel, AdminOrders, AdminOrderDetails, CreateProduct, EditProduct). Ensure the route is protected with the same admin guard pattern used for other admin routes."
        },
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Add a navigation link to the admin dashboard in the desktop navigation section when the user is authenticated and has admin privileges (use the existing isAdmin check). Place the link alongside the existing 'Admin Panel' and 'Orders' links. Use an appropriate icon from lucide-react (e.g., LayoutDashboard) and label it 'Dashboard'. Apply the same styling and hover effects as other navigation links. Also add the dashboard link to the mobile navigation menu (MobileNav component is referenced here)."
        },
        {
          "path": "frontend/src/components/MobileNav.tsx",
          "operation": "modify",
          "description": "Add a navigation link to the admin dashboard in the mobile menu when the user is authenticated and has admin privileges. Place the link alongside the existing 'Admin Panel' and 'Orders' links in the mobile slide-down menu. Use an appropriate icon from lucide-react (e.g., LayoutDashboard) and label it 'Dashboard'. Apply the same styling as other mobile navigation links."
        },
        {
          "path": "frontend/src/pages/AdminPanel.tsx",
          "operation": "modify",
          "description": "Add a navigation link or button to the admin dashboard in the AdminPanel page header section. Place it prominently near the top of the page, perhaps next to the 'Create Product' button or in a separate navigation area. Use an appropriate icon from lucide-react (e.g., LayoutDashboard) and label it 'Dashboard' or 'View Dashboard'. Style it consistently with other action buttons on the page."
        }
      ]
    },
    {
      "id": "REQ-23",
      "summary": "Display a recent orders section on the admin dashboard showing the 5 most recent orders with order ID, customer name, status, and total price, with a link to view all orders",
      "acceptanceCriteria": [
        "Recent orders section appears below the metrics cards",
        "Shows order ID, customer name, status badge, and formatted total price",
        "Orders are sorted by creation date with newest first",
        "Includes a 'View All Orders' link that navigates to AdminOrders page",
        "Displays appropriate message if no orders exist"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminDashboard.tsx",
          "operation": "modify",
          "description": "Add a recent orders section below the metrics cards grid. Use the existing useAllOrders hook to fetch all orders, then sort them by timestamp (newest first) and slice to get the 5 most recent orders. Display each order in a card or list item showing: order ID (truncated if needed), customer name from shippingDetails, OrderStatusBadge component for status, and formatted total price (NPR currency format). If no orders exist, display a friendly message like 'No orders yet'. Add a 'View All Orders' link/button at the bottom of the section that navigates to the AdminOrders page (/admin/orders) using React Router Link. Style the section consistently with the metrics cards above using the same card styling and spacing."
        }
      ]
    }
  ]
}